"""2. 爱因斯坦的难题
爱因斯坦曾出过这样一道有趣的数学题：
有一个长阶梯，若每步上2阶，最后剩1阶；
若每步上3阶，最后剩2阶；
若每步上5阶，最后剩4阶；
若每步上6阶，最后剩5阶；
只有每步上7阶，最后刚好一阶也不剩。
（小甲鱼温馨提示：步子太大真的容易扯着蛋~~~）

题目：请编程求解该阶梯至少有多少阶？"""


x = 7
i = 1
flag = 0 
while i <= 100:
    if (x % 2 == 1) and (x % 3 == 2) and (x % 5 == 4) and (x % 6 == 5):
        flag = 1
    else:
        x = 7*(i + 1) #x 为7的倍数
    i += 1

if flag == 1:
    print ("阶梯数是： ",x)
else:
    print ("没有找到")


a = 119
b = (a % 2 == 1) and (a % 3 == 2) and (a % 5 == 4) and (a % 6 == 5)
print (b)
